[{"Topic": "Vegan", "Data_id": 0, "Speaker_count": 2, "Conversation": [{"Speaker_id": 0, "Utterance_id": 0, "Content": "Why would chucking paint all over big ben persuade someone like me to give up meat?"}, {"Speaker_id": 1, "Utterance_id": 1, "Content": "As you and your viewers probably know we are in a climate an ecological emergency at the moment and so what we are doing is we're asking the government to support farmers and fishing communities in a transition to a plant-based food system because we know that animal agriculture is a leading cause of the climate crisis and so if we transition to a plant-based food system we can free up vast amount of land in the UK."}, {"Speaker_id": 0, "Utterance_id": 2, "Content": "Okay look that's all fine, that wasn't my question. My question is why does chucking paint over big ben? Why does desecrating Trafalgar square with red dye, chucking milk around harrods, destroying supermarket shells? How does that persuade me who already likes eating meat? Why are you going to persuade me by being a vandal? Don't get it."}, {"Speaker_id": 1, "Utterance_id": 3, "Content": "I think we're we're in an incredibly difficult position at the moment because we've been trying to talk about these things now for a very long time and so we're at a point where we need to escalate protest so we can gain more media attention on the subject."}, {"Speaker_id": 0, "Utterance_id": 4, "Content": "I don't know anyone you persuade. \\I haven't heard anyone go. you know what, I was a meat eater and I saw big ben being desecrated this great monument in this country and I thought I know what I'll do. I'm going to go and give up meat and start eating gruel. I haven't heard a single human being say that. Why would they?"}, {"Speaker_id": 1, "Utterance_id": 5, "Content": "I think the purpose of protests is not necessarily to win over people. It's to bring these important conversations to the table."}, {"Speaker_id": 0, "Utterance_id": 6, "Content": "But we know the conversation. You you're a vegan, right? I'm a meat eater, Why can't we just both live happily in each other's orbit? Why can't you let me just get on with eating meat and you eat your gruel and we're all go home happy."}, {"Speaker_id": 1, "Utterance_id": 7, "Content": "Because we know animal farming and fishing are a leading cause of the climate."}, {"Speaker_id": 0, "Utterance_id": 8, "Content": "We know having a strictly vegan diet is bad for you as well."}, {"Speaker_id": 1, "Utterance_id": 9, "Content": "Well that's not true."}, {"Speaker_id": 0, "Utterance_id": 10, "Content": "True a lot of science says it's bad for you. What do you eat? Do we eat almonds? Should you eat almond milk?"}]}, {"Topic": "Vegan", "Data_id": 1, "Speaker_count": 2, "Conversation": [{"Speaker_id": 0, "Utterance_id": 0, "Content": "Is a bee one of these things, an animal?"}, {"Speaker_id": 1, "Utterance_id": 1, "Content": "Of course a bee is an animal"}, {"Speaker_id": 0, "Utterance_id": 2, "Content": "if a bee's an animal, why are you slaughtering them?"}, {"Speaker_id": 1, "Utterance_id": 3, "Content": "Why are you not talking about the most important issue that is facing our planet today?"}, {"Speaker_id": 0, "Utterance_id": 4, "Content": "Because it's empty hypocrisy"}, {"Speaker_id": 1, "Utterance_id": 5, "Content": "It is not hypocris"}, {"Speaker_id": 0, "Utterance_id": 6, "Content": "I meet so many vegans who devour avocados and almonds and don't seem to realize it involves a slaughter of billions of bees"}, {"Speaker_id": 1, "Utterance_id": 7, "Content": "Both almonds and avocados are less damaging to the planets."}, {"Speaker_id": 0, "Utterance_id": 8, "Content": "Oh they're less damaging. What about how they get flown here from california? What about how they're getting trucked across Europe?"}, {"Speaker_id": 1, "Utterance_id": 9, "Content": "It's still not damaging. It's still that route. That is exactly what it is about."}, {"Speaker_id": 0, "Utterance_id": 10, "Content": "Anyway look, I'm starving and you're not gonna persuade me and my response to you, destroying all these things is to have a big mac because you know what, it's a free country, it's a democracy and i'm allowed to eat meat and i'm certainly allowed to eat meat when someone who kills bees to feed their avocado habit."}]}, {"Topic": "Immigration", "Data_id": 2, "Speaker_count": 2, "Conversation": [{"Speaker_id": 2, "Utterance_id": 0, "Content": "First of all I had a very good meeting with the President of Mexico. Very nice man. We will be doing very much better with Mexico on trade deals. Believe me. The NAFTA deal signed by her husband is one of the worst deals ever made of any kind signed by anybody. It's a disaster. Hillary Clinton wanted the wall. Hillary Clinton fought for the wall in 2006 or there abouts. Now she never gets anything done so naturally the wall wasn't built but Hillary Clinton wanted the wall."}, {"Speaker_id": 3, "Utterance_id": 1, "Content": "I voted for border security and there are..."}, {"Speaker_id": 2, "Utterance_id": 2, "Content": "And the wall"}, {"Speaker_id": 3, "Utterance_id": 3, "Content": "There are some limited places where that was appropriate there also is necessarily going to be new technology and how best to deploy that but it is clear when you look at what Donald has been proposing he started his campaign bashing immigrants, calling Mexican immigrants rapists and criminals and drug dealers. He has a very different view about what we should do to deal with immigrants. Now what I am also arguing is that bringing undocumented immigrants out from the shadows, putting them into the formal economy will be good because that employers can't exploit them and undercut Americans wages. And Donald knows a lot about this, he used undocumented labor to build the Trump Tower. He underpaid undocumented workers and when they complained he basically said what a lot of employers do: You complain I'll get you deported. I want to get everybody out of the shadows get the economy working and not let employers like Donald exploit undocumented workers which hurts them but also hurts American workers."}, {"Speaker_id": 2, "Utterance_id": 4, "Content": "The president Obama has moved millions of people out. Nobody knows about it, nobody talks about it. But under Obama millions of people have been moved out of this country. They've been deported. She doesn't want to say that but that's what's happened and that's what's happened big league. As far as moving these people out, we either have a country or we don't we're a country of laws we either have a border or we don't. Now you can come back in and you can become a citizen but it's very unfair we have millions of people that did it the right way, they're online, they're waiting. We're going to speed up the process big-league because it's very inefficient but they're online and they're waiting to become citizens. Very unfair that somebody runs across the border, becomes a citizen. Under her plan, you have open borders you would have a disaster on trade and you will have a disaster with your open borders. What we won't say is that President Obama has deported millions and millions of people just the way is."}, {"Speaker_id": 3, "Utterance_id": 5, "Content": "We will not have open border that is a mischaracterization. We will have secure borders but we will also have reform and this used to be a bipartisan issue. Ronald Reagan is the last president to sign immigration reform and George W Bush supported it as well"}]}, {"Topic": "Immigration", "Data_id": 3, "Speaker_count": 3, "Conversation": [{"Speaker_id": 4, "Utterance_id": 0, "Content": "Let me ask about your immigration policy, Mr. Vice President. The Obama Administration did fail to deliver immigration reform, which had been a key promise during the administration. It also presided over record deportations, as well as, family detentions at the border before changing course. So why should voters trust you with an immigration overhaul now?"}, {"Speaker_id": 5, "Utterance_id": 1, "Content": "Because we made a mistake made. It took too long to get it right. Took too long to get it right. I’ll be President of the United States, not Vice President of the United States. And the fact is I’ve made it very clear. Within a 100 days, I’m going to send to the United States Congress a pathway to citizenship for over 11 million undocumented people. And all of those so-called dreamers, those DACA kids, they’re going to be immediately certified again to be able to stay in this country and put on a path to citizenship. The idea that they are being sent home by this guy and they want to do that is they’ve gone to they’ve never seen before. I can imagine. You’re five years old. Your parents are taking across the Rio Grande River and it’s illegal. And you say, \"Oh, no, Mom. Leave me here. I’m not going to go with you.\" They been here. Many of them are model citizens. Over 20,000 of them are first responders out there taking care of people during this crisis. We owe them. We owe them."}, {"Speaker_id": 2, "Utterance_id": 2, "Content": "Kristen, he had eight years to do what he said he was going to do. And I’ve changed. Without having a specific, we got rid of catch and release. We got rid of a lot of horrible things that they put in and that they lived with. But he had eight years he was Vice President. He did nothing except build cages to keep children in."}, {"Speaker_id": 5, "Utterance_id": 3, "Content": "The catch and release, you know what he’s talking about there? If in fact you had a family came across and they were arrested, they in fact were given a date to show up for their hearing. They were released. And guess what? They showed up for a hearing. And this is the first President in the history of the United States of America that anybody seeking asylum has to do it in another country. That’s never happened before in America. That’s never happened before in America. You come to the United States and you make your case that, \"I seek asylum based on the following premise, why I deserve it under American law.\" They’re sitting in squalor on the other side of the river."}, {"Speaker_id": 2, "Utterance_id": 4, "Content": "So important. It just shows that he has no understanding of immigration, of the laws. Catch and release is a disaster. A murderer would come in. A rapist would come in. A very bad person would come in. We would take their name. We have to release them into our country. And then you say they come back. Less than 1% of the people come back. We have to send ICE out and Border Patrol out to find them. We would say, \"Come back in two years, three years. We’re going to give you a court case. You did Perry Mason. We’re going to give you a court case.\" When you say they come back, they don’t come back, Joe. They never come back. Only the really… I hate to say this, but those with the lowest IQ, they might come back, but there are very, very few. You don’t know the law, Joe."}, {"Speaker_id": 5, "Utterance_id": 5, "Content": "Know the law, what he’s telling you is simply not true. Check it out."}]}, {"Topic": "Immigration", "Data_id": 4, "Speaker_count": 3, "Conversation": [{"Speaker_id": 4, "Utterance_id": 0, "Content": "We’re going to talk about immigration now, gentlemen. And we’re going to talk about families within this context. Mr. President, your administration separated children from their parents at the border, at least 4,000 kids. You’ve since reversed your zero tolerance policy, but the United States can’t locate the parents of more than 500 children. So how will these families ever be reunited?"}, {"Speaker_id": 2, "Utterance_id": 1, "Content": "Children are brought here by coyotes and lots of bad people, cartels and they’re brought here and they used to use them to get into our country. We now have as strong a border as we’ve ever had. We’re over 400 miles of brand new wall. You see the numbers. And we let people in, but they have to come in legally."}, {"Speaker_id": 4, "Utterance_id": 2, "Content": "But how will you reunite these kids with their families, Mr. President?"}, {"Speaker_id": 2, "Utterance_id": 3, "Content": "But let me just tell you. Let me just tell you. They built cages. They used to say I built the cages, and then they had a picture in a certain newspaper, and it was the picture of these horrible cages and they said, \"Look at these cages. President Trump built them.\" And then it was determined they were built in 2014. That was him. They built cages."}, {"Speaker_id": 4, "Utterance_id": 4, "Content": "Do you have a plan to reunite the kids with their families?"}, {"Speaker_id": 2, "Utterance_id": 5, "Content": "Yes. We’re working on it very… We’re trying very hard. But a lot of these kids come out without the parents. They come over through cartels and through coyotes and through gangs."}, {"Speaker_id": 5, "Utterance_id": 6, "Content": "These 500-plus kids came with parents. They separated them at the border to make it a disincentive to come to begin with. \"Be real tough. We’re really strong.\" And guess what? They cannot… Coyotes didn’t bring them over. Their parents were with them. They got separated from their parents. And it makes us a laughingstock and violates every notion of who we are as a nation."}, {"Speaker_id": 2, "Utterance_id": 7, "Content": "Kristen, they did it. We changed the policy. They did it. We changed."}, {"Speaker_id": 5, "Utterance_id": 8, "Content": "We did not separate them"}, {"Speaker_id": 2, "Utterance_id": 9, "Content": "They built the cages. Who built the cages, Joe?"}]}, {"Topic": "Vegan", "Data_id": 5, "Speaker_count": 2, "Conversation": [{"Speaker_id": 0, "Utterance_id": 0, "Content": "My question is, if it were just in the fields and they were milked every day and they weren't killed, would you be fine withthat"}, {"Speaker_id": 6, "Utterance_id": 1, "Content": "We shouldn't be exploiting animals, period."}, {"Speaker_id": 0, "Utterance_id": 2, "Content": "Right, so your issue is not really about milk, is it? Your issue is just anything to do with animals you've got a problem with, right?"}, {"Speaker_id": 6, "Utterance_id": 3, "Content": "Using animals in viewing them as products immoral issue."}, {"Speaker_id": 0, "Utterance_id": 4, "Content": "What is wrong with it with a cow being milked for milk?"}, {"Speaker_id": 6, "Utterance_id": 5, "Content": "It's unnecessary. Why you need breast milk? You need breast milk from a cow? You're not a baby cow"}]}, {"Topic": "Vegan", "Data_id": 6, "Speaker_count": 3, "Conversation": [{"Speaker_id": 7, "Utterance_id": 0, "Content": "When I was in the hiking there's mountain lions that coming and kill people you known that right? That's in Orange County. That's not in the jungle in Africa."}, {"Speaker_id": 8, "Utterance_id": 1, "Content": "That's not an everyday situation"}, {"Speaker_id": 7, "Utterance_id": 2, "Content": "But it's Orange County, mountain lions have killed hikers, kids"}, {"Speaker_id": 9, "Utterance_id": 3, "Content": "Yes, we're hiking in the mountains and there's a mountain lion. I have to be aware of the fact that I'm in mountain lion territory and be like I'm okay with the risk Because to be honest I'm not hiking with a gun I have no way to defend my friend"}, {"Speaker_id": 7, "Utterance_id": 4, "Content": "You don't hike with a hiking pole."}, {"Speaker_id": 9, "Utterance_id": 5, "Content": "I mean I can pole against a mountain lion? I just want to say like even if I did and even if my attempt were to be successful. I would feel awful having killed the mountain lion."}]}, {"Topic": "Vegan", "Data_id": 7, "Speaker_count": 3, "Conversation": [{"Speaker_id": 10, "Utterance_id": 0, "Content": "Animal agriculture has reduced carbon emissions by 20 percent since 1990 65 percent of the land, the arable land, agriculture land in this country is grass. That locks in ninety billion tons of carbon into our soils, right? Animals are an essential part of the actual life cycle. They cannot emit more carbon than they eat. They are part of, they are part... and that's why Natural England and people like the RSPB actually support grazing animals. We're talking about grass-fed livestock here. We're talking about small butchers who have those short supply chains of low fat, uh, low travel distances, supporting the local food economy, which has a big effect"}, {"Speaker_id": 11, "Utterance_id": 1, "Content": "We created a documentary called The Land of Hope and Glory, online, which talks all about what happens to animals in the UK. So there's two studies. The first study is a five-year study conducted by the University of Oxford; it's the most comprehensive study that has ever been conducted exploring the relation between the environment..."}, {"Speaker_id": 10, "Utterance_id": 2, "Content": "Is this the one that was run by a vegan?"}, {"Speaker_id": 11, "Utterance_id": 3, "Content": "He wasn't vegan when he started, but he was vegan when he finished it because of what he found out. And what he discovered..."}, {"Speaker_id": 12, "Utterance_id": 4, "Content": "You may be, after this conversation, John, as well."}, {"Speaker_id": 10, "Utterance_id": 5, "Content": "Not very likely."}, {"Speaker_id": 11, "Utterance_id": 6, "Content": "What he discovered is that 83% of the farmland that we use is currently dedicated to animal agriculture and if the world shifted to a plant-based diet, we can reduce the amount of land we need to animal agriculture by 75%. He conducted it and at the end he summarized by saying: the best thing that we can do for our planet is to live a vegan lifestyle. Now the second study was most comprehensive study ever conducted exploring the relationship between food and the environment. And it said that in this country, in the UK, we have to reduce our beef, our lamb, and our pig consumption by 90 percent, and our dairy and poultry and egg consumption by 60 percent, to not hit that 1.5 degree threshold rise in twelve years' time."}]}, {"Topic": "Immigration", "Data_id": 8, "Speaker_count": 2, "Conversation": [{"Speaker_id": 13, "Utterance_id": 0, "Content": "Well first of all I think amnesty is the forgiveness of a wrong doing without consequence and that I've never supported that. I do not support that. I think there has to be consequences for violating our immigration laws. What I think is clear about this issue to begin with is we're not going to be able to make progress on illegal immigration until first illegal immigration is brought under control now."}, {"Speaker_id": 14, "Utterance_id": 1, "Content": "The Rubio Schumer amnesty plan apparently supported by the donor class which is why Washington supported it. The Rubio Schumer amnesty plan passed the Senate and it was on the verge of passing the House house leadership intended to take it up and pass it with the Democrats overruling most of the Republicans and the question for anyone on illegal immigration is where were you in that fight, where did you stand you. There is a difference between me and senator Rubio."}, {"Speaker_id": 13, "Utterance_id": 2, "Content": "When that issue was being debated, Ted Cruz at a committee hearing very passionately said I want immigration reform to pass, I want people to be able to come out of the shadows and he proposed an amendment that would have legalized people here. Not only that he proposed doubling the number of green cards, he proposed a 500% increase on guest workers now his position is different. Now he is a passionate opponent of all those things so he either wasn't telling the truth then or he isn't telling the truth now but to argue he's a purist on immigration"}, {"Speaker_id": 14, "Utterance_id": 3, "Content": "you know the lines are very very clear, Marco right now supports citizenship for 12 million people here illegally, I oppose citizenship. Marcos stood on the debate stage and said that but I would note not only that Marco has a long record when it comes to amnesty, in the state of Florida's Speaker of the House, he supported in-state tuition for illegal immigrants. In addition to that Marco went on Univision in Spanish and said he would not rescind President Obama's illegal executive amnesty on his first day in office. I have promised to rescind every single illegal executive action including that one."}, {"Speaker_id": 13, "Utterance_id": 4, "Content": "First of all I don't know how he knows what I said on Univision coz he doesn't speak Spanish and second of all this is a disturbing pattern now because for a number of weeks now Ted Cruz has just been telling lies."}]}, {"Topic": "Immigration", "Data_id": 9, "Speaker_count": 2, "Conversation": [{"Speaker_id": 16, "Utterance_id": 0, "Content": "What you're proposing or what the president's proposing here does not sound like it's in keeping with American tradition when it comes to immigration. The Statute of Liberty says give me your tired your poor, your huddled masses, yearning to breathe free doesn't say anything about speaking English or being able to be a computer programmer. Aren't you trying to change what it means to be an immigrant coming into this country? If you're telling them you have to speak English? Can't people learn how to speak English when they get here?"}, {"Speaker_id": 15, "Utterance_id": 1, "Content": "Well first of all right now it's a requirement that it be naturalized you had to speak English so the notion that speaking English wouldn't be a part of immigration systems would be actually a very ahistorical. Secondly I don't want to get off into a whole thing about history here but the Statue of Liberty is a symbol of Liberty enlightening the world, is a symbol of American liberty lighting the world, the poem that you're referring to that was added later it's not actually part of the original Statue of Liberty"}, {"Speaker_id": 16, "Utterance_id": 2, "Content": "That sounds like some national park revisionism."}, {"Speaker_id": 15, "Utterance_id": 3, "Content": "No. I appreciate your speech Jim, I appreciate your speech so let's talk about this. In 1970 when we let in 300,000 people a year, was that violating or not violating the Statue of Liberty law of the land? In nineteen in the 1990s, when it was half a million a year, was violating or not violating the Statue of Liberty law of the land? When it was seven hundred thousand years? Tell me what years meet Jim Acosta definition of the Statue of Liberty home law of the land?"}]}]